<template>
<div>
    <h1 class="document-title">はじめに</h1>
    <hr>
    <div>
        <h2>非同期的問題解決</h2>
        <p>Wikipedia、Github、ヒトゲノム計画、惑星探索などでは非同期的な協調が主であり、各方面の成果を集約するシステムが機能しています。</p>
        <p>現状でも社会問題の解決に向けたインターネットを介した取り組みがみられますが、成果を集約して調整するシステムは未だありません。</p>
        <p>SocialBoosterはユーザーの認知力、思考力、行動力を非同期的に集約し、調整する事により、問題解決を効率化します。</p>

        <h2>インフルエンサーの排除</h2>
        <p>提案の採否が提案の質ではなく提案者の影響力によって決定しまう事が多々あります。</p>
        <p>こうした社会の機会損失を防ぐためにSocialBoosterでは提案者が影響力を蓄積できないよう提案と提案者を分離するデザインと構造を持っています。</p>
        <p>提案が優れてさえいればSocialBoosterは優先的にそれを扱い、必要な支援を集中させます。</p>

        <h2>課題設定、優先順位決定の半自動化</h2>
        <p>はたして社会のリソースを適切に分配できているでしょうか。</p>
        <p>一向に改善しない労働問題、人権問題など、先に解決すべき事あるにも関わらずどうでも良さそうな事が進展するのは、社会のリーダー達の課題設定能力、優先順位決定能力が必要量を満たしていないからに他なりません。</p>
        <p>では、優れたリーダーがいれば問題が解決できるのかといえばそうではなく、社会の抱える問題は秀才、天才と言われる程度の人間では太刀打ち出来ない程に複雑化しているのです。</p>
        <p>今ある仕組みを十分に活用すれば偉人やシンギュラリティの登場を待たずして問題が解決出来ます。</p>
        <p>SocialBoosterはインターネットの力を借りて人々の認知力、思考力、行動力を集約し、適切に分配します。</p>

        <h2>プラットフォームの一元化</h2>
        <p>現状では問題解決を行う為に使用しなければならないプラットフォームが多過ぎます。</p>
        <p>問題提起を行い、支援を得るにはCampFire等のクラウドファンディングサイトを利用するといった手法がありますが、ここに企画を掲載するだけでは支援は集まりません。</p>
        <p>TwitterやFacebookを活用した周到なSNSマーケティングを駆使してはじめて多くの支援が集まるのです。</p>
        <p>資金が集まったとしてもLINEやDiscord,Slackといったプラットフォームを利用して集団を組織したり運営しなくてはならず、状況や目的に応じてプラットフォームを使い分けなければなりません。</p>
        <p>仮にその発起者が今どきの若者でプラットフォーム間の移動に何らストレスを感じない性分だったとしても、支援者の側がそれらプラットフォーム間の移動にストレスを感じないとは言えません。</p>
        <p>SocialBoosterはそれらのプラットフォームが果たす役割を一つのサイト内で完結出来るようになっており、より問題解決に特化した設計となっています。</p>
    </div>
</div>
</template>

<script>
export default {
    head: {
        title: {
            inner: 'はじめに'
        },
        meta: [{
                name: 'viewport',
                content: 'width=device-width,initial-scale=1.0,user-scalable=no'
            },
            {
                charset: 'utf-8'
            }
        ]
    }
}
</script>
