<template>
<div>
    <h1 class="document-title">システム概略</h1>
    <hr>
    <div>
        <p>SocialBooster（SB）は独自の手法によって算出した優先順位を元に問題の解決を行う非同期協調SNSです。</p>
        <strong>独自の手法</strong>
        <p>SBはコンセプト、紐付け、投票の3つの機能から優先順位を算出します。</p>

        <h2>コンセプト</h2>

        <p>ここでいう「コンセプト」は一般的な意味（”全体を貫く基本的な観点・考え方”）ではなく、当サイトが扱うコンテンツの事を指します。</p>
        <p>コンセプトにはストレス、ニーズ、アイデア、プロジェクト、コミュニティの五つの種類があります。</p>
        <p>コンセプトには５つの種類が存在します。</p>
        <p>ストレス、ニーズ、アイデア、プロジェクト、コミュニティです。</p>
        <p>ユーザーはこれらのコンセプトを自由に投稿する事が出来ます。</p>
        <p>この5つのコンセプトとその順序は問題解決の過程を抽象化したものです。</p>
        <p>ストレスは問題が露呈した段階であり、ニーズはストレスが能動的な要求になったものです。</p>
        <p>アイデアはその要求に対して一応の解決策を提示したもので、プロジェクトはその解決策を具体化したものです。</p>
        <p>最後にコミュニティがプロジェクトを実行する事で最初のストレスが解決されます。</p>
        <p>こうした構造は問題解決の非属人化に繋がります。</p>

        <h2>紐付け</h2>

        <p>問題とその解決策を理論的に説明するのは属人的な作業でしたが、SBはコンセプト構造と紐付け機能、投票機能によって理論化の半自動化と分担を可能にしています。</p>
        <p>紐付けは、コンセプトとコンセプトを関連付ける機能です。</p>
        <p>「街が汚い」というストレスと、「街を綺麗にしたい」というニーズの紐付けによって、「街が汚いから綺麗にしたい」という理論が成立します。</p>
        <p>この理論の成立にはストレスの投稿、ニーズの投稿、コンセプト同士の紐付けの3回の作業が必要ですが、全てを一人のユーザーが行う必要はありません。</p>
        <p>ユーザーは理論の成立に責任を持つ必要はありません。何れかの作業を完了するだけで問題の解決に貢献出来ます。</p>
        <p>投稿と紐付けはそれぞれ独立した作業であり同期的な協調は必要ありません。ある朝にAのユーザーがストレスの投稿を行い、またある昼にBのユーザーがニーズの投稿を行い、またある夜にそれらを紐付けるCのユーザーさえ現れれれば理論は成立するのです。</p>
        <p>この仕組みは実際の場合もう少し複雑になります。</p
        <p>1つのストレスに対してニーズを幾つも紐付ける事が可能であり、ニーズにも幾つものアイデアが紐付けられます。</p>
        <p>アイデアは幾つものニーズ、プロジェクトと紐付ける事ができ、コンセプトとその理論体系はユーザーの行動に応じて大規模なネットワークを形成します。</p>

        <h2>投票</h2>

        <p>ユーザーはコンセプトと紐付けに対して投票を行う事ができ、これを元にSBは優先順位を算出します。</p>
        <p>コンセプトの優先順位と表示順位はイコールであり、優先度の高いコンセプトは上位に表示され全ユーザーからの注目を得ます。</p>
        <p>ユーザーの注目を得られたコンセプトは他の優先順位の低いコンセプトよりも状況が好転する確率が高くなり、実際に状況が好転したコンセプトがあればその優先順位を下げ、相対的に状況がまだ好転していないコンセプトの優先順位を上げます。</p>
        <p>このサイクルは設計的に常態化されており、システムは表示順位を操作する事でユーザーの能力を一部の優先順位が高いコンセプトに集約します。</p>
        <p>メディアや通常のSNSは優先順位算出の仕組みを持たず、問題が解決したかに関わらず新たな議論を始めるため市民は社会が改善した実感をいつまで経っても得る事が出来ません。</p>
        <p>SocialBoosterでは既存の優先順位の高い問題が進展あるいは解決するまで他の問題と対峙する事を許さない設計を持っている為、問題の解決とそれに基づく成功体験をユーザーに提供出来ます。</p>
    </div>
</div>
</template>

<script>
export default {
    head: {
        title: {
            inner: 'システム概略'
        },
        meta: [{
                name: 'description',
                content: 'SocialBooster（SB）はコンセプト、紐付け、投票の３つの要素によって優先順位を算出します。'
            },
            {
                name: 'viewport',
                content: 'width=device-width,initial-scale=1.0,user-scalable=no'
            },
            {
                charset: 'utf-8'
            }
        ]
    }
}
</script>
