<template>
<div>
    <h1 class="document-title">コミュニティとプロジェクト</h1>
    <hr>
    <div>
        <h2>コミュニティとプロジェクトの特徴</h2>
        <p>ストレス～アイデアまでのコンセプトと違い、コミュニティとプロジェクトはチャット機能が用意されています。</p>
        <p>チャットの内容はユーザー全員が確認する事が出来ますが、発言権はコミュニティであればコミュニティに参加したユーザー、プロジェクトであればプロジェクトと紐付けられたコミュニティに参加しているユーザーに限られています。</p>
        <p>コミュニティへの参加と、チャットの内容の確認はコンセプト下部の<b-icon icon="people" font-scale="1"></b-icon>から行えます。</p>
        <p>プロジェクトのチャットの内容の確認はコンセプト下部の<b-icon icon="chat-dots" font-scale="1"></b-icon>から行えます。</p>

        <h2>コミュニティのプロジェクトに対する影響力</h2>
        <p>SocialBoosterのコミュニティはあくまでも集団に過ぎず、事業はプロジェクトとして分離しています。</p>
        <p>コミュニティは政策や事業にあたるプロジェクトを独占出来ません。プロジェクトに対して権限を行使出来るのは、プロジェクトから見た時に最も紐付け比率が多いコミュニティです。</p>
        <p>つまり、コミュニティのプロジェクトに対する影響力を決めるのはコミュニティのメンバーを含むSocialBoosterのユーザー全員なのです。</p>

        <h2>なぜコミュニティはプロジェクトを独占できないのか</h2>
        <p>これはちょっとした実験です。</p>
        <p>国民は選挙により政治や行政を司る政治家を選ぶ事が出来ます。しかし、政治と同様生活に大きく影響する企業の在り方を国民が決める事は出来ません。企業の決定権は株主と株主が権限を委任した者のみが持っています。</p>
        <p>SocialBoosterは国民が影響を与えられる範囲を政治だけでなく企業、NPO、オンラインコミュニティの領分にも拡大できないか試みています。</p>

        <h2>プロジェクトを介したコミュニティ間の協力</h2>
        <p>プロジェクトのチャットを介してコミュニティ間のメンバーは交流し、協力します。この場合コミュニティは部署として見る事も出来ます。</p>
        <p>プロジェクトがラーメン屋だとすると、あるコミュニティは接客、あるコミュニティは調理、あるコミュニティは広報を専門的に担います。</p>
        <p>企業や行政と違うのは、コミュニティはその能力を複数のプロジェクトに提供する点にあります。</p>
        <p>これにより、コミュニティの能力を必要な箇所に迅速に供給する事が出来るようになります。</p>
    </div>
</div>
</template>

<script>
export default {
    head: {
        title: {
            inner: 'コミュニティとプロジェクト'
        },
        meta: [{
                name: 'viewport',
                content: 'width=device-width,initial-scale=1.0,user-scalable=no'
            },
            {
                charset: 'utf-8'
            }
        ]
    }
}
</script>
