<template>
<div>
    <h1 class="document-title">注意事項</h1>
    <hr>
    <div>
      <h2>レイヤーが曖昧なコンセプトを投稿しない</h2>
      <p>レイヤーが曖昧なコンセプトは投稿しないでください。</p>
      <p>「教育格差を是正するために、教育予算を増額する」という文章は、二つのレイヤーにかかったレイヤーが曖昧な内容です。</p>
      <p>「教育格差の是正」はニーズレイヤーの内容であり、「教育予算を増額する」はアイデアレイヤーの内容です。</p>
      <p>こうした内容の場合はまずどちらかのレイヤーから先に投稿して、後から紐付けてください。</p>
      <p>ただし、プロジェクトレイヤーとコミュニティレイヤーの場合はそこまで明確に分離する必要はありません。</p>
      <p>プロジェクトの場合、ものごとを計画するのに必要不可欠な要素であればストレス、ニーズ、アイデアに属する内容が入っていても許容します。</p>
      <p>コミュニティの場合は、どういった性質、方針を持つ集団として活動するのかに関する内容が中心であれば、
        ストレス、ニーズ、アイデア、プロジェクトに属する内容が入っていても許容します。</p>
      <h2>コンセプトは削除できません</h2>
      <p>現状、ユーザーは投稿したコンセプトを削除することはできません。</p>
      <p>これは、投票を集めたコンセプトが後から内容を大きく変更した場合に、不正な集計が行われてしまうことを危惧した為です。</p>
      <p>投稿したコンセプトを修正したい場合は、新規に修正の内容を反映したコンセプトを投稿してください。</p>
      <p>※プロジェクトレイヤー、コミュニティレイヤーに関しては編集機能が検討されています。</p>
      <p>どうしても削除したいという場合には管理者にご連絡ください。</p>

      <h2>コンセプトは修正・削除されることがあります</h2>
      <p>レイヤーによって推奨される文法から逸脱したコンセプトが投稿された場合には、管理者の裁量により内容を修正、削除することがあります。</p>
    </div>
</div>
</template>

<script>
export default {
    mounted() {}
}
</script>
