<template>
<div>
    <h1 class="document-title">概略</h1>
    <hr>
    <div>
        <p>SocialBoosterは問題解決 SNS です。地域、政治、環境、社会、人権、ビジネス上のあらゆる問題に応用出来ます。問題解決とありますが、SocialBoosterが問題を直接解決するわけではありません。</p>
        <p>既に解決されているか、意識されない程に小さくなった問題の背景には必ず行政や企業、自治体や非営利法人といったコミュニティがあります。たとえば水は本来貴重なものですが、今は公園の水道で蛇口をひねるだけで喉を潤す事が出来ます。公園の水道設備は地域の役所などのコミュニティによって維持されています。</p>
        <p>今ある問題はそれに対応できるようなコミュニティが存在しないか活動の規模が足りていないのです。SocialBoosterは問題を発見して評価し、その問題に見合う規模のコミュニティを成立させる事で問題解決を助けます。</p>
        <p>これにあたり、SocialBoosterはコンセプトの登録、紐付け、投票をユーザーにお願いしています。</p>

        <h2>コンセプトの登録</h2>

        <p>あなたが感じた身の回りの問題、政府や所属する会社に対する要求、ふと思いついたアイデア、ふと考えた事業はありませんか？</p>
        <p>そのまま忘れてしまう前にSocialBoosterに以上の内容を登録してみてください。</p>
        <p>SocialBoosterに登録できる内容は以下の通りです。</p>
        <b-table :items="concepts" small class="document-table"></b-table>
        <p>登録された内容は後述する紐付けと投票を経て問題解決に役立てられます。</p>

        <h2>紐付け</h2>

        <p>SocialBoosterに登録したものをコンセプトと言います。コンセプトはそれ単体では大して意味を持ちません。コンセプトは紐付けにより関連付けられる事で理論の一段落として機能するようになります。</p>
        <p>河川敷にゴミが大量に捨てられているというストレスがあれば、これを解決に近付けるニーズを探し、紐付けてください。</p>
        <p>きっと、河川敷を綺麗にしたい、河川敷にゴミを捨てられないようにしたい、といったニーズが見付かるはずです。</p>
        <p>もし、見つからなければあなたがそのストレスを解決に近付ける事のできるニーズを考案し、登録して紐付けてください。</p>
        <p>紐付けの条件は以下の通りです。</p>
        <b-table :items="covers" small class="document-table"></b-table>

        <h2>投票</h2>

        <p>あなたが進展を期待するコンセプトに投票してください。投票には重み付けが出来ます。</p>
        <p>また、コンセプトの個別コンセプトに紐付けられている上位コンセプトの一覧から、そのコンセプトを解決に近付けられるだろうとあなたが判断したコンセプトとの紐付けに投票してください。コンセプトと同様紐付けに対する投票でも重み付けが出来ます。</p>
        <p>コンセプトに対する投票と紐付けに対する投票は別種のものです。</p>
        <p>2種類の投票からSocialBoosterはコンセプトの優先順位を算出します。</p>

        <h2>優先順位</h2>

        <p>優先順位が高いコンセプトは社会に向けられている期待に見合うだけの社会の対応がされていません。</p>
        <p>ストレス～プロジェクトの場合の対応は、上位のレイヤーとの実のある紐付けがされていないと対応が不足であるとして優先順位が高くなります。</p>
        <p>コミュニティの対応は、期待に見合う規模の活動をするのに必要な人材が不足している場合に優先順位が高くなります。</p>
        <p>優先順位の高さと一覧での表示順は一致しています。</p>
        <p>優先順位が高く、より上部に表示されたコンセプトは紐付けやコミュニティへの参加といった対応がされやすくなります。</p>
        <p>紐付けやコミュニティの参加によって期待と対応との差が小さくなった場合は優先順位が下がり、表示順も下がります。</p>
        <p>表示順が常に入れ替わるなかでSocialBoosterはユーザーの能力を適切に分配していきます。</p>
        <p>こうしたサイクルによりコミュニティは期待に見合う人員を得る事ができ、問題解決に不足なく取り組む事が出来ます。</p>


    </div>
</div>
</template>

<script>
export default {
    data() {
        return {
            concepts: [{
                    包括: '問題',
                    該当: 'ストレス'
                },
                {
                    包括: '要求、要望、欲求',
                    該当: 'ニーズ'
                },
                {
                    包括: '創意工夫',
                    該当: 'アイデア'
                },
                {
                    包括: '計画、企画、事業、政策',
                    該当: 'プロジェクト'
                },
                {
                    包括: '省庁、政党、企業、非営利法人、自治体、オンラインコミュニティ',
                    該当: 'コミュニティ'
                }
            ],
            covers: [{
                    レイヤー: 'ストレス',
                    紐付け可能レイヤー: 'ニーズ'
                },
                {
                    レイヤー: 'ニーズ',
                    紐付け可能レイヤー: 'ストレス、アイデア'
                },
                {
                    レイヤー: 'アイデア',
                    紐付け可能レイヤー: 'ニーズ、プロジェクト'
                },
                {
                    レイヤー: 'プロジェクト',
                    紐付け可能レイヤー: 'アイデア、コミュニティ'
                },
                {
                    レイヤー: 'コミュニティ',
                    紐付け可能レイヤー: 'プロジェクト'
                }
            ]
        }
    },
    head: {
        title: {
            inner: '概略'
        },
        meta: [{
                name: 'description',
                content: 'SocialBoosterはコンセプト、紐付け、投票の３つの要素によって優先順位を算出します。'
            },
            {
                name: 'viewport',
                content: 'width=device-width,initial-scale=1.0,user-scalable=no'
            },
            {
                charset: 'utf-8'
            }
        ]
    }
}
</script>

<style>
.document-table {
	font-size: 15px;
}

</style>
