<template>
<div>
    <h1 class="document-title">優先順位の算出</h1>
    <hr>
    <div>
        <h2 class="document-section">着手率</h2>
        <p class="document-shadow">着手率 = 対応率 ÷ 期待率 × 100</p>
        <p>SBでの表示順、つまり優先順位は”着手率”という指標に基づいて決定されます。
        <p>
        <p>この指標の理想値は100で、このSNS上でのコンセプトは100着手率を目指します。あるコンセプトの着手率が100を下回った状態であれば、
            それが期待されている割に対応が進んでいないと言う事を表します。逆に100を上回る場合は期待に対して過剰な対応をしているという事になります。</p>
        <p>SBではこの着手率が低い順にソートされるため、着手率が低い程注目され、逆に高い程注目されないようになっています。</p>
        <p>この着手率による順番の入れ替わりが繰り返される事により、大して社会に必要とされていないのに無駄に騒がれているテーマから社会のリソースを奪い、
          逆に社会に必要とされている分野に社会のリソースを供給するのです。</p>

        <h2 class="document-section">対応率</h2>
        <p class="document-shadow">対応率 = そのコンセプトの対応数 ÷ そのコンセプトが属するレイヤーの対応数の合計 × 100</p>

        <h2 class="document-section">対応数</h2>
        <p>対応数はストレスからプロジェクトレイヤーの場合とコミュニティレイヤーの場合で算出方法が異なります。</p>
        <strong>ストレスからプロジェクトレイヤーの場合</strong></br>
        <p class="document-shadow">対応数　＝　そのコンセプトの上位方向への紐付けに対して＋以上の投票をしているユーザーの合計</p>
        <p>紐付けに対して投票されているということは、そのコンセプトに対して実のある提案がされているという事を表します</p>

        <strong>コミュニティレイヤーの場合</strong><br>
        <p class="document-shadow">対応数　＝　そのコミュニティに参加しているユーザーの合計数</p>
        <p>※ユーザーは複数のコミュニティに参加できる仕様上これは実質的ではないため、コミュニティへの参加時間や発言数といった選択肢も検討されています。</p>

        <h2 class="document-section">期待率（加算投票率）</h2>
        <p class="document-shadow">期待率 ＝ コンセプトの加算投票数 ÷ コンセプトが属するレイヤーの加算投票数の合計 × 100</p>
        <p>この値が大きいほど社会に進展が望まれているコンセプトだと言えます。</p>

        <h2 class="document-section">加算投票数</h2>
        <p class="document-shadow">加算投票数 ＝ {紐付け比率 × 紐付けられた下位のコンセプトの加算投票数}を紐付けごとに行った結果の合計にそのコンセプト自身の投票数を加えたもの。</p>

        <h2 class="document-section">コンセプト投票数</h2>
        <p>そのコンセプトに対するコンセプト実質投票数の合計</p>
        <h2 class="document-section">コンセプト実質投票数</h2>
        <p>※ユーザーとコンセプトの組み合わせごとに算出されます。</p>
        <p class="document-shadow">コンセプト実質投票数 ＝ そのコンセプトに対するそのユーザーの仮投票の合計 ÷ そのユーザーの仮投票の合計</p>

        <h2 class="document-section">コンセプト仮投票数</h2>
        <p>※ユーザーとコンセプトの組み合わせごとに算出されます。</p>
        <p class="document-shadow">コンセプト仮投票数 ＝ ＋投票 + －投票</p>
        <p>※一定期間より以前の投票は＋だろうと－だろうと集計されなくなる。古い投票が無効化されることで実質投票数は新しく投票しなければ減っていくので、
          システムの自浄能力として作用する</p>

        <h2 class="document-section">紐付け比率</h2>
        <p class="document-shadow">紐付け比率 ＝ その紐付けの投票数 ÷ その紐付けと下位コンセプトを同じくする紐付けの合計紐付け投票数 × 100</p>
        <p>※コンセプトの加算投票数を算出する時はこの比率に応じて加算されることになります。</p>

        <h2 class="document-section">紐付け投票数</h2>
        <p>そのコンセプトに対する紐付け実質投票数の合計</p>

        <h2 class="document-section">紐付け実質投票数</h2>
        <p>※ユーザーとその紐付けの組み合わせごとに算出されます。</p>
        <p class="document-shadow">紐付け実質投票数 ＝ その紐付けに対するユーザーの仮投票の合計
           ÷ その紐付けの下位にあるコンセプトを同じくする紐付けに対するユーザーの仮投票の合計</p>

         <h2 class="document-section">紐付け仮投票数</h2>
         <p>※ユーザーと紐付けの組み合わせごとに算出されます</p>
         <p class="document-shadow">紐付け仮投票数 ＝ ＋投票 + －投票</p>
         <p>※一定期間より以前の投票は＋だろうと－だろうと集計されなくなる。古い投票が無効化されることで実質投票数は新しく投票しなければ減っていくので、
           システムの自浄能力として作用する。</p>
    </div>
</div>
</template>

<script>
export default {
    mounted() {}
}
</script>

<style>
.document-title {
    font-size: 1.5rem;
    margin-left: 20px;
    margin-top: 30px;
}

.document-section {
    font-size: 1.35rem;
    margin: 10px 0px 10px 0px;
}

.document-shadow {
    background: #0000000d;
    padding: 10px;
}
</style>
