<template>
<div>
    <h1 class="document-title">紐付け</h1>
    <hr>
    <div>
      <h2>紐付けとは</h2>
      <p>コンセプトとコンセプトは上下の階層においてのみ紐付ける事ができます。</p>
      <p>コンセプトを階層的に考える場合は、レイヤーという呼び方をします。</p>
      <p>ストレスの上位にはニーズ、ニーズの上位にはアイデア、アイデアの上位にはプロジェクト、プロジェクトの上位にはコミュニティがあります。</p>
      <p>ストレスレイヤーのコンセプトと紐付けられるのはニーズレイヤーのコンセプトのみであり、ニーズレイヤーはストレスとアイデアレイヤーのコンセプトと紐付けられます。</p>
      <p>紐付けの数に制限はありません。</p>
      <p>コンセプトは直近のレイヤーのコンセプトであれば複数紐付ける事が出来ます。</p>
      <h2>紐付けをするには</h2>
      <p>紐付けはコンセプトの下部右下にある上下の矢印から出来ます。</p>
      <p>上矢印が上位に対する紐付けであり、下矢印が下位に対する紐付けです。</p>
      <p>基準となるコンセプトがアイデアであれば、新規にプロジェクトレイヤーのコンセプトを作成するか既存のプロジェクトレイヤーコンセプトと紐付ける事が出来ます。</p>
      <p>下位に対してはニーズレイヤーのコンセプトの作成か、既存のニーズレイヤーコンセプトとの紐付けができます。</p>

      <h2>紐付けの意味</h2>
      <p>ニーズとその上位に位置するアイデアの紐付けは提案のようなものです。</p>
      <p>「街を綺麗にしたい」というニーズに対して、アイデアである「ゴミ拾いをする」が提案されます。</p>
      <p>この「ゴミ拾いをする」を上位に紐付けるとプロジェクトになります。</p>
      <p>プロジェクトでは、いつゴミ拾いをするのか、どこでやるのかが明確になり、アイデアの実現に必要な情報が揃います。</p>
      <p>更に上位に紐付けるとコミュニティになります。</p>
      <p>コミュニティが「ゴミ拾いをする」アイデアを具体化したプロジェクトと紐付けられると、紐付けられたコミュニティがそのプロジェクトの実行者となります。</p>
      <p>このように、上位に対する紐付けは問題を解決するための流れだと言えます。</p>
      <p>逆に下位への紐付けやその確認は、上位のコンセプトに本当に意義があるのかを調べる流れです。</p>
      <p>ストレスやニーズと紐付きの少ないアイデア、プロジェクトには社会的な意義は無く、そこに重きを置くコミュニティがあればそのコミュニティは社会に貢献していないことを表します。</p>
      <p><router-link to="/document/vote">投票</router-link>と<router-link to="/document/priority">優先順位の算出</router-link>で詳しく述べますが、紐付け比率に応じて投票数を伝搬する役割もあります。</p>
    </div>
</div>
</template>

<script>
export default {
    mounted() {}
}
</script>
