<template>
<div>
    <h1 class="document-title">コンセプト</h1>
    <hr>
    <div>
        <h2>コンセプトの種類</h2>
        <p>ここでいう「コンセプト」は一般的な意味（”全体を貫く基本的な観点・考え方”）ではなく、当サイトが扱うコンテンツの事を指します。</p>
        <p>コンセプトにはストレス、ニーズ、アイデア、プロジェクト、コミュニティの五つの種類があります。</p>
        <h3>ストレス</h3>
        <p>ストレスは愚痴や不満、不服を包括するコンセプトです。</p>
        <p>学校、会社、家庭、社会に対するありとあらゆる不満はストレスに分類されます。</p>
        <h3>ニーズ</h3>
        <p>ニーズは要求や欲求、要望を包括するコンセプトです。</p>
        <p>学校、会社、家庭、社会に対する要望はニーズに分類されます。</p>
        <h3>アイデア</h3>
        <p>アイデアは工夫や抽象的な施策を包括するコンセプトです。</p>
        <p>○○したほうがいいんじゃないか、○○を○○したらいいのではないか、等の目標が明確な内容はアイデアに分類されます。</p>
        <h3>プロジェクト</h3>
        <p>プロジェクトは計画といった、具体的な施策を包括するコンセプトです。</p>
        <p>会社でいえば商品の企画書、政治でいえば法案に基づいた施策などがプロジェクトに分類されます。</p>
        <h3>コミュニティ</h3>
        <p>コミュニティは企業、政党、民間堕胎といった組織、集団を包括するコンセプトです。</p>
        <p>企業、教育団体、政党、NPO、NGO、といった集団の体を成しているものはコミュニティに分類されます。</p>
        <p>俗に言う意識の高い団体、集団もここに分類されます。</p>

        <h2>コンセプトの投稿</h2>
        <p>コンセプトは自由に投稿する事が出来ます。</p>
        <p>ストレスの投稿は問題の告発のようなもので、ニーズの投稿は市民の欲求を訴えるのと似ています。</p>
        <p>アイデアの投稿は手段の提案にあたり、プロジェクトの投稿は計画の提案にあたります。</p>
        <p>コミュニティの投稿はコミュニティの設立と同義です。</p>
        <p>ユーザーは設立されたコミュニティに自由に参加する事が出来ます。</p>
        <p>コミュニティは紐付け機能によってプロジェクトに参画する事ができ、プロジェクトの実行・運営を行います。</p>
        <p>プロジェクトとコミュニティにはチャット機能が用意されており、実行や運営に関しての相談が行えます。</p>

        <h2>コンセプトの意味</h2>
        <p>ストレス、ニーズ、アイデア、プロジェクト、コミュニティの順番は重要な意味を持ちます。</p>
        <p>ストレスは人体でいうところの痛覚であり、コミュニティは運動器官にあたります。ニーズ、アイデア、プロジェクトは脳の思考であり、
          ストレスを欲求たるニーズに変換し、そのニーズを実現する抽象的なアイデアを想起します。アイデアを具体化するためにプロジェクトを構想し、
          プロジェクトをコミュニティによって実現するのです。</p>
        <p>この過程は人間のみならず社会や集団といった規模にもあてはめる事ができます。</p>
        <p>社会では問題たるストレスの発生にはコミュニティを組織して対応にあたります。
          この問題が市場的なものであればコミュニティは企業であり
          、政治的なものであればコミュニティは政府になります。</p>
        <p>集団内においても、発生したストレスは会議室の中で議論され、ニーズ化、アイデア化、プロジェクト化を経て実働するプロジェクトチームたるコミュニティが組織されます。</p>
        <p>インターネットの世界では、Twitterに吹き荒れるツイートはストレス、ニーズ、アイデアに分類でき、
          キャンプファイヤーといったクラウドファンディングサイトのコンテンツはプロジェクトに分類できます。DiscordやLINEはコミュニティにあたります。</p>
    </div>
</div>
</template>

<script>
export default {
    mounted() {}
}
</script>
