<template>
<div>
    <h1 class="document-title">紐付け</h1>
    <hr>
    <div>
      <h2>紐付けとは</h2>
      <p>コンセプトとコンセプトは紐付ける事ができます。</p>
      <p>何でも紐付けられるというものではなく、上下の階層においてのみ紐付ける事ができます。</p>
      <p>コンセプトを階層的に考える場合は、レイヤーという呼び方をします。</p>
      <p>ストレスレイヤーのコンセプトと紐付けられるのはニーズレイヤーのみであり、ニーズレイヤーはストレスとアイデアレイヤーのみと紐付けられます。</p>
      <p>紐付けの数に制限はありません。</p>
      <p>ニーズは複数のアイデアと紐付ける事ができ、複数のストレスとも紐付け出来ます。</p>
      <h2>紐付けをするには</h2>
      <p>紐付けはコンセプトの下部右下にある上下の矢印から出来ます。</p>
      <p>上矢印が上位に対する紐付けであり、下矢印が下位に対する紐付けです。</p>
      <p>基準となるコンセプトがアイデアであれば、新規にプロジェクトレイヤーのコンセプトを作成するか既存のプロジェクトレイヤーコンセプトと紐付ける事ができます。</p>
      <p>下位に対してはニーズレイヤーのコンセプトの作成か、既存のニーズレイヤーコンセプトとの紐付けができます。</p>

      <h2>紐付けの意味</h2>
      <p>ニーズに対して上位のレイヤーであるアイデアとの紐付けは提案のようなものです。</p>
      <p>「街を綺麗にしたい」というニーズに対して、アイデアである「ゴミ拾いをする」が提案されます。</p>
      <p>この「ゴミ拾いをする」を上位に紐付けるとプロジェクトになります。</p>
      <p>プロジェクトでは、いつゴミ拾いをするのか、どこでやるのかとより具体的になります。</p>
      <p>更に上位に紐付けるとコミュニティになります。</p>
      <p>コミュニティが「ゴミ拾いをする」アイデアを具体化したプロジェクトと紐付けられると、紐付けられたコミュニティがそのプロジェクトの実行者となります。</p>
      <p>このように、上位に対する紐付けは問題を解決するための流れだと言えます。</p>
      <p>逆に下位への紐付けやその確認は、上位のコンセプトレイヤーに本当に意義があるのかを調べる流れです。</p>
      <p>ストレスやニーズレイヤーと紐付きの少ないアイデア、プロジェクトがあれば、それは社会的意義のないコンセプトであり、そこに重きを置くコミュニティがあればそのコミュニティは社会に貢献していないことを表します。</p>
      <p><router-link to="/document/vote">投票</router-link>と<router-link to="/document/priority">優先順位の算出</router-link>で詳しく述べますが、紐付け比率に応じて投票数を伝搬する役割もあります。</p>
    </div>
</div>
</template>

<script>
export default {
    mounted() {}
}
</script>
