<template>
<div>
    <h1 class="document-title">優先順位の算出</h1>
    <hr>
    <div>
        <p>ここで紹介されている指標はコンセプトや紐付けの下部にある<b-icon icon="bar-chart" font-scale="1"></b-icon>をクリックする事で確認出来ます</p>
        <h2 class="document-section">着手率</h2>
        <p class="document-shadow">着手率 = 対応率 ÷ 期待率 × 100</p>
        <p>着手率はそのコンセプトに向けられている社会（SocialBoosterに登録しているユーザー）の期待（応援）に対して社会の対応（関心、議論、判断、施策や事業の展開など）が相当しているか表す指標です。</p>
        <p>期待に相当した対応がされているコンセプトの着手率は100になります。コンセプトの着手率が100を下回っている場合は対応量が期待量より少ない事を、100を上回る場合は対応量が期待量より多い事を表します。
        <p>SocialBoosterのコンセプトは着手率が低い順に表示されます。上位に表示されているコンセプトは注目されるため社会の対応を得やすくなりますが、下位に表示されているコンセプトは注目されにくいため、社会の対応を得にくくなります。</p>
        <p>着手率の低いコンセプトほど注目され、社会の対応を得ると着手率が上がるので、この表示順は常に変動し、社会の関心を適切に分配します。</p>

        <h2 class="document-section">対応率</h2>
        <p>対応率はSocialBooster上での相対的な対応量を表す指標です。</p>
        <p class="document-shadow">対応率 = そのコンセプトの対応数 ÷ そのコンセプトが属するレイヤーの対応数の合計 × 100</p>
        <p>この値が大きいほど社会に対応されている事を表します。</p>

        <h2 class="document-section">対応数</h2>
        <p>対応数はそのコンセプトが社会からどれだけ対応されているかを表す指標です。</p>
        <p>SocialBoosterは全コンセプトの着手率の向上を促す構造になっています。着手率が100になる為には期待に相当した分の対応がされる必要があり、対応の内容はレイヤーによって異なります。</p>
        <b-table :items="support" small class="document-table"></b-table>
        <strong>ストレス～プロジェクトレイヤーの場合</strong><br>
        <p class="document-shadow">対応数 = そのコンセプトの上位方向への紐付けに対して投票しているユーザーの合計</p>
        <p>ストレス～プロジェクトではそのコンセプトの上位方向への紐付けに対して投票しているユーザーの合計を対応としています。</p>
        <p>ユーザーは、紐付けの上位のコンセプトが下位のコンセプトを進展させうると判断した時に紐付けに投票します。</p>
        <p>つまり、期待に相当するだけのユーザー数が紐付けに投票したという事は、その下位のコンセプトを進展せる考えが既にこの世に存在している事を表すのです。</p>
        <p>ストレスにとってそれはニーズであり、ニーズにとってそれはアイデアであり、アイデアにとってそれはプロジェクトであり、プロジェクトにとってそれはコミュニティなのです。</p>
        <strong>コミュニティレイヤーの場合</strong><br>
        <p class="document-shadow">対応数 = そのコミュニティに参加しているユーザーの合計</p>
        <p>実際に問題を解決し、課題に向かうのはコミュニティであるため、コミュニティよりも下位のレイヤーに属するコンセプトは紐付けにより上位に論点を移行させていきます。コミュニティはコミュニティ以下のコンセプトの期待をまとめて引き受ける特別なレイヤーなのです。</p>

        <h2 class="document-section">期待率</h2>
        <p>期待率はSocialBooster上での相対的な期待量を表す指標です。</p>
        <p class="document-shadow">期待率 = コンセプトの加算得票数 ÷ コンセプトが属するレイヤーの加算得票数の合計 × 100</p>
        <p>この値が大きいほど社会に進展が望まれている事を表します。</p>

        <h2 class="document-section">加算得票数</h2>
        <p class="document-shadow">加算得票数 = {紐付け比率 × 紐付けられた下位のコンセプトの加算得票数}を紐付けごとに行った結果の合計にそのコンセプト自身の得票数を加えたもの。</p>

        <h2 class="document-section">コンセプト得票数</h2>
        <p class="document-shadow">コンセプト得票数 = そのコンセプトに対するコンセプト実質投票数の合計</p>

        <h2 class="document-section">コンセプト実質投票数</h2>
        <p>※ユーザーとコンセプトの組み合わせごとに算出されます。</p>
        <p class="document-shadow">コンセプト実質投票数 = そのコンセプトに対するそのユーザーの仮投票の合計 ÷ そのユーザーの仮投票の合計</p>

        <h2 class="document-section">コンセプト仮投票数</h2>
        <p>※ユーザーとコンセプトの組み合わせごとに算出されます。</p>
        <p class="document-shadow">コンセプト仮投票数 = ＋投票 + －投票</p>
        <p>※一定の期間が経過したコンセプト仮投票は集計されなくなります。</p>

        <h2 class="document-section">紐付け比率</h2>
        <p class="document-shadow">紐付け比率 = その紐付けの得票数 ÷ その紐付けと下位コンセプトを同じくする紐付けの合計紐付け得票数 × 100</p>
        <p>※コンセプトの加算投票数を算出する時はこの比率に応じて加算されることになります。</p>

        <h2 class="document-section">紐付け得票数</h2>
        <p class="document-shadow">紐付け得票数 = そのコンセプトに対する紐付け実質投票数の合計</p>

        <h2 class="document-section">紐付け実質投票数</h2>
        <p>※ユーザーとその紐付けの組み合わせごとに算出されます。</p>
        <p class="document-shadow">紐付け実質投票数 = その紐付けに対するユーザーの仮投票の合計 ÷ その紐付けの下位にあるコンセプトを同じくする紐付けに対するユーザーの仮投票の合計</p>

        <h2 class="document-section">紐付け仮投票数</h2>
        <p>※ユーザーと紐付けの組み合わせごとに算出されます</p>
        <p class="document-shadow">紐付け仮投票数 = +投票 + -投票</p>
        <p>※一定の期間が経過した紐付け仮投票は集計されなくなります。</p>
    </div>
</div>
</template>

<script>
export default {
    data() {
        return {
            support: [{
                    レイヤー: 'ストレス',
                    対応: 'そのストレスの上位方向への紐付けに対して投票しているユーザーの合計'
                },
                {
                    レイヤー: 'ニーズ',
                    対応: 'そのニーズの上位方向への紐付けに対して投票しているユーザーの合計'
                },
                {
                    レイヤー: 'アイデア',
                    対応: 'そのアイデアの上位方向への紐付けに対して投票しているユーザーの合計'
                },
                {
                    レイヤー: 'プロジェクト',
                    対応: 'そのプロジェクトの上位方向への紐付けに対して投票しているユーザーの合計'
                },
                {
                    レイヤー: 'コミュニティ',
                    対応: 'そのコミュニティへの参加者数'
                },
            ]
        }
    },
    head: {
        title: {
            inner: '優先順位'
        },
        meta: [{
                name: 'description',
                content: 'コンセプトの表示順位は優先順位と同一であり、着手率が低い程優先順位が高くなります。重要な指標である着手率がどのような処理を経て算出されるのかについてご説明します。'
            },
            {
                name: 'viewport',
                content: 'width=device-width,initial-scale=1.0,user-scalable=no'
            },
            {
                charset: 'utf-8'
            }
        ]
    }
}
</script>
