<template>
<div>
    <h1 class="document-title">概略</h1>
    <hr>
    <div>
        <p>SocialBoosterは問題解決 SNS です。地域、政治、環境、社会、人権、ビジネス上のあらゆる問題に応用出来ます。問題解決とありますが、SocialBoosterが問題を直接解決するわけではありません。</p>
        <p>既に解決されているか、意識されない程に小さくなった問題の背景には必ず行政や企業、自治体や非営利法人といったコミュニティがあります。たとえば水は本来貴重であるはずのものですが、今は公園の水道で蛇口をひねるだけで喉を潤す事が出来ます。公園の水道設備は地域の役所などのコミュニティによって維持されています。</p>
        <p>今ある問題はそれに対応できるようなコミュニティが存在しないか活動の規模が足りていないのです。SocialBoosterはそれらの問題に見合う規模のコミュニティを成立させる事で問題解決を助けます。</p>
        <p>これにあたり、SocialBoosterはコンセプトの登録、紐付け、投票をユーザーにお願いしています。</p>

        <h2>コンセプトの登録</h2>

        <p>あなたが感じた身の回りの問題、政府や所属する会社に対する要求、ふと思いついたアイデア、ふと考えついた事業はありませんか？</p>
        <p>そのまま寝てせっかくの発想を忘れてしまう前に、SocialBoosterにこれらの登録してみてください。</p>
        <p>SocialBoosterに登録できる内容は以下の通りです。</p>
        <b-table :items="concepts" small class="document-table"></b-table>
        <p>登録された内容は後述する紐付けと投票を経て問題解決に役立てられます。</p>

        <h2>紐付け</h2>

        <p>SocialBoosterに登録したものをコンセプトと言います。コンセプトはそれ単体では大して意味を持ちません。コンセプトは紐付け機能により関連付けられる事で理論の一段落として機能するようになります。</p>
        <p>河川敷にゴミが大量に捨てられているというストレスがあれば、これを解決に近付けるニーズを探し、紐付けてください。</p>
        <p>きっと、河川敷を綺麗にしたい、河川敷にゴミを捨てられないようにしたい、といったニーズが見付かるはずです。</p>
        <p>もし、見つからなければあなたがそのストレスを解決に近付ける事のできるニーズを考案し、登録して紐付けてください。</p>
        <p>紐付けが可能になる条件は以下の通りです。</p>
        <b-table :items="covers" small class="document-table"></b-table>

        <h2>投票</h2>

        <p>あなたが進展を期待するコンセプトに投票してください。</p>
        <p>また、コンセプトに紐付けられている上位コンセプトの一覧から、そのコンセプトを進展させるだろうと判断できるコンセプトとの紐付けに投票してください。</p>
        <p>コンセプトに対する投票と紐付けに対する投票は別種のものです。</p>
        <p>二種類の投票からSocialBoosterはコンセプトの優先順位を算出します。</p>

        <h2>優先順位</h2>
        <p>SocialBoosterは投票を元にそのコンセプトが社会にどれだけ期待されているかを算出します。同時に、そのコンセプトがどれだけ対応されているかを算出し、されていなければ優先順位を高く設定します。</p>
        <p>優先順位と表示順位は同じものです。優先順位が高い程ホーム画面で上位に表示されます。</p>
        <p>ユーザー、そして社会はホーム画面の上位に表示されている優先順位の高いコンセプトに対応しなくてはなりません。</p>
        <p>何をもって対応とするかはコミュニティとストレス～プロジェクトで異なります。</p>
        <h3>コミュニティの場合</h3>
        <p>コミュニティが上位に表示されている場合、そのコミュニティに向けられている期待と活動の規模が見合っていない事を表します。</p>
        <p>活動の規模はそのコミュニティに参加しているユーザーの数から算出します。期待とコミュニティの参加者数が見合っていないとき、コミュニティの優先順位は高くなります。</p>
        <p>もしあなたがこのコミュニティに貢献できるのであれば是非参加してください。参加者数が期待に見合う程になるとコミュニティの表示順位・優先順位は自ずと下がっていきます。</p>
        <h3>ストレス～プロジェクトの場合</h3>
        <p>ストレス～プロジェクトが上位に表示されている場合、そのコンセプトに有意義なコンセプトが紐付けられていない事を表します。</p>
        <p>もしあなたがこのストレスにニーズを提示出来るのなら、このニーズにアイデアを提案できるのなら、このアイデアを実現するプロジェクトを構想できるのなら、このプロジェクトを実行するコミュニティを結成できるのなら、是非そうしてください。</p>
        <p>有意義なコンセプトとの紐付けが集まれば、それに投票するユーザーが現れます。SocialBoosterはそれらを集計して対応の度合いを算出します。</p>
        <p>多くのユーザーに投票されるほど有意義な紐付けがされるようになればそのコンセプトの表示順位・優先順位は下がります。</p>
        <h2>問題解決アルゴリズム</h2>
        <p>SocialBoosterの内部では、ストレスをニーズに、ニーズをアイデアに、アイデアをプロジェクト、プロジェクトをコミュニティにと、問題を解決する過程を進行させるアルゴリズムが働いています。こうした設計により、問題にあたる当初のストレスがコミュニティによって解決される事を構造化しているのです。</p>

    </div>
</div>
</template>

<script>
export default {
    data() {
        return {
            concepts: [{
                    包括: '問題、愚痴、不満、不服',
                    該当: 'ストレス'
                },
                {
                    包括: '要求、要望、欲求',
                    該当: 'ニーズ'
                },
                {
                    包括: '創意工夫',
                    該当: 'アイデア'
                },
                {
                    包括: '計画、企画、事業、政策',
                    該当: 'プロジェクト'
                },
                {
                    包括: '省庁、政党、企業、非営利法人、自治体、オンラインコミュニティ',
                    該当: 'コミュニティ'
                }
            ],
            covers: [{
                    レイヤー: 'ストレス',
                    紐付け可能レイヤー: 'ニーズ'
                },
                {
                    レイヤー: 'ニーズ',
                    紐付け可能レイヤー: 'ストレス、アイデア'
                },
                {
                    レイヤー: 'アイデア',
                    紐付け可能レイヤー: 'ニーズ、プロジェクト'
                },
                {
                    レイヤー: 'プロジェクト',
                    紐付け可能レイヤー: 'アイデア、コミュニティ'
                },
                {
                    レイヤー: 'コミュニティ',
                    紐付け可能レイヤー: 'プロジェクト'
                }
            ]
        }
    },
    head: {
        title: {
            inner: '概略'
        },
        meta: [{
                name: 'description',
                content: 'SocialBoosterはコンセプト、紐付け、投票の３つの要素によって優先順位を算出します。'
            },
            {
                name: 'viewport',
                content: 'width=device-width,initial-scale=1.0,user-scalable=no'
            },
            {
                charset: 'utf-8'
            }
        ]
    }
}
</script>
