<template>
<div>
    <h1 class="document-title">紐付け</h1>
    <hr>
    <div>
        <h2>紐付けとは</h2>
        <p>紐付けはコンセプトとコンセプトを関連付ける機能です。</p>
        <p>紐付けは紐付けの内容によってその意味合いが異なってきます。</p>
        <b-table :items="upper" small class="document-table"></b-table>
        <p>元のコンセプトよりも対象のコンセプトの方が上位にある場合は物事を進展させるという意味合いになりますが、元のコンセプトよりも対象のコンセプトが下位にある場合はコンセプトの意義を確認する意味合いになります。</p>
        <b-table :items="lower" small class="document-table"></b-table>
        <p>下位への紐付けは当初の想定になかったものの紐付けてみると意味が通るものである場合に行われます。</p>

        <h2>紐付けの役割</h2>
        <h3>対立の抑制</h3>
        <p>インターネットで問題の解決方法を議論するとき、ちょっとした前提の相違や誤読から壮絶な対立に繋がる事があります。</p>
        <p>SocialBoosterでは意見の共有を返信ではなく上下のレイヤーでのみ行える紐付けで担うため、インターネット上での直接的なコミュニケーションによって人々の能力が不毛な対立や炎上に消費される事を防ぎます。</p>
        <h3>不特定多数による協力</h3>
        <p>政治上の問題でITを使えば解決出来る事は枚挙に遑がありません。好んで政治に関わるような人に限ってITについての見識がなく、制度と人手で問題にあたろうとします。</p>
        <p>SocialBoosterは紐付けの際にコンセプトを登録したユーザーに断りをいれる必要がありません。</p>
        <p>官僚が提案する歪なIT政策にプログラマー達は手を加える事が出来ませんが、SocialBoosterであれば紐付けによっていくらでも新しい道を提示する事が出来ます。</p>

        <h2>紐付けるには</h2>
        <p>紐付けはコンセプトの右下にある上下の矢印から行います。</p>
        <p>上を向く矢印から上位方向への紐付けを行う事が出来ます。元となるコンセプトがアイデアであればその上位にあるのはプロジェクトです。</p>
        <p>フォームに必要事項を記載して登録すれば元となるコンセプトと新しく登録したコンセプトとの紐付けが行われます。</p>
        <p>下を向く矢印から下位方向への紐付けを行う事が出来ます。元となるコンセプトがアイデアであればその下位にあるのはニーズです。</p>
        <p>フォームに必要事項を記載して登録すれば元となるコンセプトと新しく登録したコンセプトとの紐付けが行われます。</p>
        <p>また、紐付けられる数に制限はありません。</p>

        <h3>既存コンセプトとの紐付け</h3>
        <p>上述の方法では新たに登録したコンセプトと紐付ける事になりますが、既存のコンセプトを紐付けたい場合は紐付けたいコンセプトと同じ内容の文をフォームに入力する事で対象のコンセプトを検索して紐付ける事が出来ます。</p>
    </div>
</div>
</template>

<script>
export default {
    data() {
        return {
            upper: [{
                元: 'ストレス',
                対象: 'ニーズ',
                意味: 'ストレスに対して方向性の提示',
            }, {
                元: 'ニーズ',
                対象: 'アイデア',
                意味: 'ニーズを満たすアイデアの提案',
            }, {
                元: 'アイデア',
                対象: 'プロジェクト',
                意味: 'アイデアを実現しうるプロジェクトの提案',
            }, {
                元: 'プロジェクト',
                対象: 'コミュニティ',
                意味: 'プロジェクトを実行するコミュニティの結成/既存コミュニティへの参画依頼',
            }],
            lower: [{
                元: 'コミュニティ',
                対象: 'プロジェクト',
                意味: 'プロジェクトへの参画、プロジェクトの作成',
            }, {
                元: 'プロジェクト',
                対象: 'アイデア',
                意味: 'プロジェクトによるアイデアの包摂',
            }, {
                元: 'アイデア',
                対象: 'ニーズ',
                意味: 'アイデアによるニーズの包摂',
            }, {
                元: 'ニーズ',
                対象: 'ストレス',
                意味: 'ニーズによるストレスの包摂',
            }],
        }
    },
    head: {
        title: {
            inner: '紐付け'
        },
        meta: [{
                name: 'description',
                content: '紐付けはコンセプトとコンセプトを関連付ける機能です。紐付けを介した複雑な計算により優先順位の精度を向上させています。'
            },
            {
                name: 'viewport',
                content: 'width=device-width,initial-scale=1.0,user-scalable=no'
            },
            {
                charset: 'utf-8'
            }
        ]
    }
}
</script>
