<template>
<div>
    <h1 class="document-title">投票</h1>
    <hr>
    <div>
      <h2>コンセプトへの投票</h2>
      <p>そのコンセプトを応援したい時にユーザーがとるべき行動は投票です。</p>
      <p>投票できる数に制限はありません。</p>
      <p>ユーザーの投票はまず仮投票として処理され、後に実質投票数としてそのコンセプトの投票数に集計されます。</p>
      <p>投票数の多いコンセプトはそれだけ優先順位が高くなり、注目されることで進展が早くなります。</p>
      <p>実質投票数はそのコンセプトへの投票数すなわち仮投票をユーザーの仮投票の合計（コンセプト）で割ったものです。</p>
      <p>Aのコンセプトに40の仮投票、Bのコンセプトに60の仮投票があった場合、そのAのコンセプトに対する実質投票は0.4であり、Bに対しては0.6です。</p>
      <p>こうした手順を踏むことでユーザーの本当の投票数（実質投票）は1を維持され、システムが公正に保たれるのです。</p>

      <h2>紐付けへの投票</h2>
      <p>コンセプトと同様に紐付けに対しても投票ができます。</p>
      <p>仮投票や実質投票といった構造は同じですが、一つ算出の手法が異なる部分があります。</p>
      <p>その紐付けへの仮投票数を仮投票の合計（紐付け）で割るのではなく、下位のコンセプトを同じくする紐付けの仮投票の合計（紐付け）で割ります。</p>
      <p>ここでユーザーの実質投票数が算出され、それらを紐付け投票数に合計します。</p>

      <h3>紐付け投票の意味</h3>
      <p>この機能に何の意味があるのか一見分からないかもしれませんが、これも重要な機能の一つです。</p>
      <p>SBでは、意味のない紐付けが出来てしまいます。</p>
      <p>「犬の殺処分を止めたい」というニーズに、「消費税をゼロにする」という紐付けが出来てしまうのです。</p>
      <p>もしこの紐付けがまかり通れば、このニーズコンセプトに集まった投票が、「消費税をゼロにする」アイデアの投票数に加算されてしまいます。</p>
      <p>この評価の加算を阻止するのが紐付けへの投票です。もし、この紐付けへの投票が集まらなければこの紐付けの紐付け比率は0になります。</p>
      <p>紐付け比率は紐付け投票数を下位のコンセプトを同じくする紐付けの合計紐付け投票数で割ったものです。</p>
      <p>投票が上位に紐付けられたコンセプトに加算される時、紐付け比率がかけられます。</p>
      <p>加算される投票数 = 紐付け比率 × 投票数</p>
      <p>つまり、消費税をゼロにするというコンセプトには一つの投票数も加算されないのです。</p>

      <h3>紐付け投票の有効例</h3>
      <p>まともな例を見てみましょう。</p>
      <p>「犬の殺処分を止めたい」というニーズに「野良犬と飼い主のマッチングアプリを作る」「犬の販売を禁止する」「引き取った飼い主にはお金が貰える」というアイデアが紐付けられてるとします。</p>
      <P>「犬の殺処分を止めたい」の加算投票数<router-link to="/document/priority">（加算投票数の詳細はこちら）</router-link>が1000だったとします。</P>
      <p>こうした紐付け比率の場合、それぞれに加算される投票数は以下です。</p>
      <P>野良犬と飼い主のマッチングアプリを作る：80%:800</P>
      <P>犬の販売を禁止する：5%:50</P>
      <P>引き取った飼い主にはお金が貰える：15%:150</P>

      <p>いってみれば紐付けは記憶と記憶を結ぶ脳の細胞であり、紐付け比率はその細胞の線の太さです。</p>
      <p>コンセプト投票と紐付け投票の二種類の投票によって高度な知性のようなものが生まれます。</p>

      <h2>忘却処理</h2>
      <p>コンセプト仮投票と紐付け仮投票は一定期間が経つと集計されなくなります。</p>
      <p>仮投票が消滅するとそれは実質投票にも影響し、コンセプト投票と紐付け投票が再計算されます。</p>
      <p>投稿/紐付けから一定期間たった後、投票がゼロ、あるいは微量すぎる場合にはその投稿/紐付けは消滅します。※コンセプトの場合は加算投票数</p>
      <p>これは人間が下らない記憶を忘れるようなものです。</p>
      <p>古い不必要なコンセプトが存在し続けるという事はありません。</p>
    </div>
</div>
</template>

<script>
export default {
    mounted() {}
}
</script>
