<template>
<DocumentFrame title="意図">
        <h2>非同期的問題解決</h2>
        <p>Wikipedia、Github、ヒトゲノム計画、惑星探索などは非同期的な協調が主であり、各々の成果を集約するシステムが機能しています。</p>
        <p>現状でも社会問題の解決に向けたインターネットを介した取り組みがみられますが、こうした分野の成果を集約して調整するシステムは未だありません。</p>
        <p>SocialBoosterはユーザーの各種能力を非同期的に集約して調整する事により、問題解決を効率化します。</p>

        <h2>インフルエンサーの排除</h2>
        <p>提案の採否が提案の質ではなく提案者の影響力によって決定しまう事が多々あります。</p>
        <p>こうした社会の機会損失を防ぐためにSocialBoosterでは提案者が影響力を蓄積できないよう提案と提案者を分離するデザインと構造を持っています。</p>
        <p>提案が優れてさえいればSocialBoosterはそれを優先的に扱い、必要な支援を集中させます。</p>

        <h2>課題設定・優先順位決定の半自動化</h2>
        <p>はたして社会のリソースを適切に分配できているでしょうか。</p>
        <p>一向に改善しない労働問題、人権問題など、先に解決すべき事あるにも関わらずどうでも良さそうな事が進展するのは、社会のリーダー達の課題設定能力、優先順位決定能力が必要量を満たしていないからに他なりません。</p>
        <p>では、優れたリーダーがいれば問題が解決できるのかといえばそうではなく、社会の抱えている問題が秀才、天才と言われる程度の人間では太刀打ち出来ない程に複雑化してきているのです。</p>
        <p>SocialBoosterはインターネットを介して人々から意見を集約し、課題設定や優先順位の決定を集合知的に行います。</p>

        <h2>プラットフォームの一元化</h2>
        <p>今やインターネット上で社会貢献が完結する時代となりましたが、現状では問題解決を行う為に使用しなければならないプラットフォームが多過ぎます。</p>
        <p>問題提起を行い、支援を得るにはCampFire等のクラウドファンディングサイトが有用ですが、ここに企画を掲載するだけでは支援は集まりません。</p>
        <p>TwitterやFacebookを活用した周到なSNSマーケティングを行ってはじめて支援が集まるのです。</p>
        <p>資金が集まっていざ事を起こすにも、集団を率いるにはLINEやDiscord,Slackといった別のツールを利用しなくてはなりません。</p>
        <p>SocialBoosterはそれらのプラットフォームやツールにあるような機能をあらかた内包しており、SocialBoosterのみで社会問題に立ち向かえる環境を目指しています。</p>
</DocumentFrame>
</template>

<script>
import DocumentFrame from "../../Assets/DocumentFrame/DocumentFrame"
export default {
    components: {
      DocumentFrame
    },
    head: {
        title: {
            inner: '意図'
        },
        meta: [{
                name: 'viewport',
                content: 'width=device-width,initial-scale=1.0,user-scalable=no'
            },
            {
                charset: 'utf-8'
            }
        ]
    }
}
</script>
