<template>
<div>
    <h1 class="document-title">投票</h1>
    <hr>
    <div>
        <h2>コンセプトへの投票</h2>
        <p>ホーム画面にあるコンセプトであなたが進展を期待するものがあればコンセプトの右下にある<b-icon icon="heart" font-scale="1"></b-icon>をクリックすると表示されるポップアップから投票してください。</p>
        <b-table :items="concepts" small class="document-table"></b-table>
        <p>ユーザーは１人で１の票数を有しており、ユーザーはこの票数を複数のコンセプトに割り振る事が出来ます。</p>
        <p>例えば、Aのコンセプトに40% Bのコンセプトに60%と割り振る事が出来ます。</p>

        <h2>紐付けへの投票</h2>
        <p>ホーム画面からコンセプトをクリックするとコンセプトの個別ページに遷移します。画面下部に紐付けられているコンセプトの一覧が表示されており、その中に元となるコンセプトを進展させうるコンセプトがあればその紐付けに投票してください。</p>
        <b-table :items="covers" small class="document-table"></b-table>
        <p>ユーザーは元となるコンセプトごとに１の票数を有しており、元となるコンセプトの上位方向への紐付けに対して票数を割り振る事ができます。</p>

        <h2>投票の意味</h2>
        <p>投票はコンセプトの表示順位に影響を与えます。</p>
        <p>どのように表示順位を計算しているかを知りたい方は<router-link to="/document/priority">優先順位の算出</router-link>を読んでください。</p>

        <h2>投票の有効期限</h2>
        <p>コンセプトへの投票と紐付けへの投票の２つには１年の有効期限が設定される予定です。</p>
        <p>有効期限を過ぎた投票は集計されなくなるため、ユーザーの過去の判断に引きづられる事なく、可能な限り実態に即した優先順位の算出が行われるようになります。</p>

        <h2>コンセプトの自動削除</h2>
        <p>（加算得票数）得票数が一定の水準を下回った状況が一定期間続いたコンセプトと紐付けは削除される機能の実装を予定しています。</p>
        <p>丁度、どうでも良い記憶が思い出せなくなる脳の機能と似ています。</p>

    </div>
</div>
</template>

<script>
export default {
    data() {
        return {
            concepts: [{
                レイヤー: 'ストレス',
                期待される進展: 'ストレス（問題）が解決される'
            }, {
                レイヤー: 'ニーズ',
                期待される進展: 'ニーズ（要求）が満たされる'
            }, {
                レイヤー: 'アイデア',
                期待される進展: 'アイデアが実行される'
            }, {
                レイヤー: 'プロジェクト',
                期待される進展: 'プロジェクトが実行される'
            }, {
                レイヤー: 'コミュニティ',
                期待される進展: 'コミュニティが活動する'
            }],
            covers: [{
                元となるレイヤー: 'ストレス',
                投票すべき紐付け: 'ストレスを解決する方向性として的確なニーズ'
            },{
                元となるレイヤー: 'ニーズ',
                投票すべき紐付け: 'ニーズを満たせるアイデア'
            },{
                元となるレイヤー: 'アイデア',
                投票すべき紐付け: '実現可能性がありアイデアが反映されているプロジェクト'
            },{
                元となるレイヤー: 'プロジェクト',
                投票すべき紐付け: 'プロジェクトを問題なく実行・運用できるコミュニティ'
            }]
        }
    },
    head: {
        title: {
            inner: '投票',
            separator: '-',
            complement: 'SocialBooster'
        },
        meta: [{
                name: 'description',
                content: 'コンセプトと紐付けに対して行える投票は、解決するべき問題の優先順位を算出する上で重要な役割を果たします。市民の声を訴える手法としても有効です。'
            },
            {
                name: 'viewport',
                content: 'width=device-width,initial-scale=1.0,user-scalable=no'
            },
            {
                charset: 'utf-8'
            }
        ]
    }
}
</script>
