<template>
<div>
    <h1 class="document-title">注意事項</h1>
    <hr>
    <div>
      <h2>レイヤーが曖昧なコンセプトを登録しない</h2>
      <p>レイヤーが曖昧なコンセプトは登録しないでください。</p>
      <p>「教育格差を是正するために、教育予算を増額する」という文章は、二つのレイヤーにかかったレイヤーが曖昧な内容です。</p>
      <p>「教育格差の是正」はニーズレイヤーの内容であり、「教育予算を増額する」はアイデアレイヤーの内容です。</p>
      <p>こうした内容である場合はまずどちらかのレイヤーから先に登録して、後から紐付けてください。</p>
      <p>ただし、プロジェクトレイヤーとコミュニティレイヤーの場合はそこまで明確に分離する必要はありません。</p>
      <p>プロジェクトの場合、ものごとを計画するのに必要不可欠な要素であればストレス、ニーズ、アイデアに属する内容が入っていても許容します。</p>
      <p>コミュニティの場合は、どういった性質や方針を持つ集団として活動するのかに関する内容が中心であれば、ストレス、ニーズ、アイデア、プロジェクトに属する内容が入っていても許容します。</p>

      <h2>主張を絞る</h2>
      <p>ストレス、ニーズ、アイデアレイヤーでは主張を一つに絞って下さい。</p>
      <p>「年金が当てにならないので心配だ。地域のコミュニティも脆弱で困ったときに誰に相談すれば、良いか心配になる。」</p>
      <p>こちらの文章では「年金が当てにならないので心配だ。」と「地域のコミュニティも脆弱で困ったときに誰に相談すれば、良いか心配になる。」の二つの主張が混在しています。</p>
      <p>主張ごとにコンセプトを登録してください。</p>

      <h2>疑問符・感嘆符を入れない</h2>
      <p>ストレス、ニーズ、アイデアレイヤーでは”？”を入れないで下さい。</p>
      <p>「教育なくして国家の再興はありえるのか？いや、ない。」というようなコンセプトはいざ一覧した時に瞬時に主張を理解出来ないので控えて下さい。</p>
      <p>この場合、「教育を推進するべきだ」としてください。</p>
      <p>ストレス、ニーズ、アイデアレイヤーでは”！”を入れないで下さい。</p>
      <p>「教育予算を増額するべきだ！」というようなコンセプトはいざ一覧した時に感覚的な差異が生まれやすいので控えて下さい。</p>
      <p>この場合、「教育予算を増額するべきだ」としてください。</p>

      <h2>コンセプトは編集出来ません</h2>
      <p>コンセプトを編集することは出来ません。</p>
      <p>多くのユーザーから投票を得られるような善良な内容だったコンセプトがある日を境に豹変して差別的な内容や猥褻な内容になったりすれば、票数を割り振ったユーザーの判断とすれ違いが生じてしまう為です。</p>

      <h2>コンセプトは削除出来ません</h2>
      <p>コンセプトは登録された時点で社会の共有財産となるため、ユーザーの判断で削除する事は出来ません。</p>

      <h2>コンセプトは修正・削除されることがあります</h2>
      <p>管理者が、推奨される文法から逸脱する内容であるものの有用な内容を含んだコンセプトであると判断した場合、管理者により推奨される文法に沿った内容に編集される事があります。</p>
      <p>また、修正する余地がないほど推奨される文法から逸脱している場合や、社会的に問題の生じる内容である場合は管理者によって削除されます。</p>
    </div>
</div>
</template>

<script>
export default {
    mounted() {}
}
</script>
