<template>
<div>
    <h1 class="document-title">優先順位の算出</h1>
    <hr>
    <div>
        <h2 class="document-section">着手率</h2>
        <p class="document-shadow">着手率 = 対応率 ÷ 期待率 × 100</p>
        <p>着手率はそのコンセプトに向けられている社会（SBに登録しているユーザー）の期待（応援）に対して社会の対応（関心、議論、判断、施策や事業の展開など）が見合っているかを表す指標です。</p>
        <p>期待に見合った対応がされているコンセプトの着手率は100になります。コンセプトの着手率が100を下回っている場合は対応量が期待量より少ない事を、100を上回る場合は対応量が期待量より多い事を表します。
        <p>SBのコンセプトは着手率が低い順に表示されます。上位に表示されているコンセプトはそれだけ注目されるため、社会の対応を得やすくなりますが、下位に表示されているコンセプトは注目されにくいため、社会の対応を得にくくなります。</p>
        <p>着手率の低いコンセプトが注目され、社会の対応を得ると着手率が上がるので、この表示順は常に変動し、社会の総対応力を適切に分配するように機能します。</p>

        <h2 class="document-section">対応率</h2>
        <p>対応率はSB上での相対的な対応量を表す指標です。</p>
        <p class="document-shadow">対応率 = そのコンセプトの対応数 ÷ そのコンセプトが属するレイヤーの対応数の合計 × 100</p>
        <p>この値が大きいほど社会に対応されている事を表します。</p>

        <h2 class="document-section">対応数</h2>
        <p>対応数はそのコンセプトが社会からどれだけ対応されているかを表す指標です。</p>
        <p>SocialBoosterは全コンセプトの着手率の向上を促す構造になっています。着手率が100になる為には期待に見合った対応がされる必要があり、対応の内容はレイヤーによって異なります。</p>
        <ul>
            <li>ストレスの場合、そのストレスを解決する方向として望ましいニーズと紐付けられる必要があります。</li>
            <li>ニーズの場合、そのニーズを満たしうるアイデアと紐付けられる必要があります。</li>
            <li>アイデアの場合、そのアイデアを実現し得るプロジェクトと紐付けられる必要があります。</li>
            <li>プロジェクトの場合、そのプロジェクトを実行する主体として相応しいコミュニティと紐付けられる必要があります。</li>
            <li>コミュニティの場合、期待に見合うだけの活動が出来るよう相応の人手を集める必要があります。</li>
        </ul>
        <strong>ストレス～プロジェクトレイヤーの場合</strong><br>
        <p class="document-shadow">対応数 = そのコンセプトの上位方向への紐付けに対して投票しているユーザーの合計</p>
        <p>ストレス～プロジェクトでは紐付けが必要になります。紐付け自体は簡単にできてしまうため紐付けの数を対応数とは出来ません。そこで、それが対応数を算出するコンセプトを進展（解決、満たす、実現、実行）させるものとして相応しいコンセプトとの紐付けがあるかを測る必要があります。</p>
        <p>相応しいかどうかを機械が判断する事は出来ないので、対応数を算出するコンセプトの上位方向への紐付けに対して投票しているユーザーの合計を対応数として用いています。</p>
        <p>ユーザーが対応数を算出するコンセプトの上位の紐付けのどれにも投票しなかったとすれば、それはどのコンセプトとの紐付けも対応数を算出するコンセプトを進展させるものとして不十分であるとユーザーが判断した為です。そうなれば対応数は増えず、期待率に変動がない限り着手率が上がらない為引き続き対応数を算出するコンセプトを進展させうる新たなコンセプトの投稿（登録）か紐付けを促します。</p>
        <strong>コミュニティレイヤーの場合</strong><br>
        <p class="document-shadow">対応数 = そのコミュニティに参加しているユーザーの合計</p>
        <p>実際に問題を解決し、課題に向かうのはコミュニティであるため、コミュニティよりも下位のレイヤーに属するコンセプトは紐付けにより上位に論点を移行させていきます。コミュニティはコミュニティ以下のコンセプトの期待をまとめて引き受ける特別なレイヤーなのです。</p>

        <h2 class="document-section">期待率</h2>
        <p>期待率はSB上での相対的な期待量を表す指標です。</p>
        <p class="document-shadow">期待率 = コンセプトの加算得票数 ÷ コンセプトが属するレイヤーの加算得票数の合計 × 100</p>
        <p>この値が大きいほど社会に進展が望まれている事を表します。</p>

        <h2 class="document-section">加算得票数</h2>
        <p class="document-shadow">加算得票数 = {紐付け比率 × 紐付けられた下位のコンセプトの加算得票数}を紐付けごとに行った結果の合計にそのコンセプト自身の得票数を加えたもの。</p>

        <h2 class="document-section">コンセプト得票数</h2>
        <p>そのコンセプトに対するコンセプト実質投票数の合計</p>

        <h2 class="document-section">コンセプト実質投票数</h2>
        <p>※ユーザーとコンセプトの組み合わせごとに算出されます。</p>
        <p class="document-shadow">コンセプト実質投票数 = そのコンセプトに対するそのユーザーの仮投票の合計 ÷ そのユーザーの仮投票の合計</p>

        <h2 class="document-section">コンセプト仮投票数</h2>
        <p>※ユーザーとコンセプトの組み合わせごとに算出されます。</p>
        <p class="document-shadow">コンセプト仮投票数 = ＋投票 + －投票</p>
        <p>※一定期間より以前の投票は集計されなくなります。新しく投票しなければ実質投票数は徐々に減っていくのでシステムの自浄能力として作用します。</p>

        <h2 class="document-section">紐付け比率</h2>
        <p class="document-shadow">紐付け比率 = その紐付けの得票数 ÷ その紐付けと下位コンセプトを同じくする紐付けの合計紐付け得票数 × 100</p>
        <p>※コンセプトの加算投票数を算出する時はこの比率に応じて加算されることになります。</p>

        <h2 class="document-section">紐付け得票数</h2>
        <p>そのコンセプトに対する紐付け実質投票数の合計</p>

        <h2 class="document-section">紐付け実質投票数</h2>
        <p>※ユーザーとその紐付けの組み合わせごとに算出されます。</p>
        <p class="document-shadow">紐付け実質投票数 = その紐付けに対するユーザーの仮投票の合計 ÷ その紐付けの下位にあるコンセプトを同じくする紐付けに対するユーザーの仮投票の合計</p>

        <h2 class="document-section">紐付け仮投票数</h2>
        <p>※ユーザーと紐付けの組み合わせごとに算出されます</p>
        <p class="document-shadow">紐付け仮投票数 = +投票 + -投票</p>
        <p>※一定期間より以前の投票は集計されなくなります。新しく投票しなければ実質投票数は徐々に減っていくのでシステムの自浄能力として作用します。</p>
    </div>
</div>
</template>

<script>
export default {
    head: {
        title: {
            inner: '優先順位'
        },
        meta: [{
                name: 'description',
                content: 'コンセプトの表示順位は優先順位と同一であり、着手率が低い程優先順位が高くなります。重要な指標である着手率がどのような処理を経て算出されるのかについてご説明します。'
            },
            {
                name: 'viewport',
                content: 'width=device-width,initial-scale=1.0,user-scalable=no'
            },
            {
                charset: 'utf-8'
            }
        ]
    }
}
</script>
