<template>
<div>
    <h1 class="document-title">コンセプト</h1>
    <hr>
    <div>
        <h2>コンセプトとは</h2>
        <p>ここでいう「コンセプト」は一般的な意味（”全体を貫く基本的な観点・考え方”）ではなく、当サイトが扱うコンテンツの事を指します。</p>
        <p>コンセプトにはストレス、ニーズ、アイデア、プロジェクト、コミュニティの五つの種類があります。</p>
        <h3>ストレス</h3>
        <p>ストレスは問題や愚痴、不満、不服を包括するコンセプトです。</p>
        <ul>
            <li>河川敷にゴミが溢れている</li>
            <li>労働に無駄が多い</li>
        </ul>
        <p>など、会社、生活、学校、社会、地域での不満や慢性化している問題などはストレスに分類されます。</p>
        <h3>ニーズ</h3>
        <p>ニーズは要望、要求、欲求を包括するコンセプトです。</p>
        <ul>
            <li>河川敷のゴミを片付けたい！</li>
            <li>河川敷にゴミを捨てられないようにしたい</li>
            <li>労働における無駄を減らしたい</li>
        </ul>
        <p>など、学校、会社、家庭、社会、地域に対する要望はニーズに分類されます。</p>
        <h3>アイデア</h3>
        <p>アイデアは創意工夫や抽象的な施策を包括するコンセプトです。</p>
        <ul>
            <li>定期的に河川敷のゴミを片付けるイベントを開く</li>
            <li>子どもたちにゴミはきちんと持ち帰らなければならない事を教える</li>
        </ul>
        <p>などの方向性を帯びた内容がアイデアに分類されます。</p>
        <h3>プロジェクト</h3>
        <p>プロジェクトは計画、企画、事業、政策といった、具体的な施策を包括するコンセプトです。</p>
        <ul>
            <li>◯月◯日◯曜日に、◯◯にて小学生とその家族を対象とした清掃イベントを開催…</li>
            <li>◯◯小学生で毎年市民意識の形成を目的とした総合の授業を行う…講師は◯◯先生…</li>
        </ul>
        <p>漠然としたアイデアと違い、それを読むだけで内容を再現出来る必要があります。</p>
        <h3>コミュニティ</h3>
        <p>コミュニティは省庁、政党、企業、非営利法人、自治体といった組織、集団を包括するコンセプトです。</p>
        <ul>
            <li>◯◯小学校</li>
            <li>◯◯市役所</li>
            <li>◯◯株式会社</li>
        </ul>
        <p>オンラインコミュニティもここで扱う事が出来ます。</p>

        <h2>コンセプトの意味</h2>
        <h3>問題解決過程の規格化</h3>
        <p>ストレス、ニーズ、アイデア、プロジェクト、コミュニティの並び順は適当なものではなく、ストレスがコミュニティによって解決されるまでの過程を表しています。</p>
        <p>この過程は政治は勿論のこと、ビジネスなど様々な分野に共通しています。</p>
        <p>問題解決の過程をコンセプトにより規格化する事で問題意識やアイデアを分野の垣根を超えて共有する事が出来ます。</p>
        <h3>主張の簡略化</h3>
        <p>ものごとを主張するためには綿密な論理や文才が必要とされますが、SocialBoosterであれば漠然としたアイデアであっても登録する事ができます。</p>
        <p>それが価値のある内容であれば、不特定多数のユーザーによってプロジェクトやニーズと紐付けられ、壮大な理論の一段落としてアイデアが役立てられるようになります。</p>
        <h3>意見が重複しない</h3>
        <p>恐らく殆どの発想には先駆者がいるでしょう。Twitterでは過去に同じ発言をした者がいてもそれを知る事は殆どありませんが、SocialBoosterの場合登録フォームの内容に似たようなものがあればユーザーに警告を行い登録を防ぎます。</p>

        <h2>コンセプトの登録</h2>
        <p>コンセプトはホーム画面右上の＋ボタンから自由に登録する事が出来ます。</p>
        <p>ストレスの登録は問題の告発のようなものです。ニーズの登録は市民の欲求を訴えるのと似ています。</p>
        <p>アイデアの登録は手段の提案、プロジェクトの登録は計画の提案にあたります。</p>
        <p>コミュニティを登録するとSocialBooster上にコミュニティが設立され、ユーザーは自由に参加する事が出来ます。</p>
        <h3>チャット機能</h3>
        <p>プロジェクトとコミュニティはそれぞれチャット機能を有しています。</p>
        <p>コミュニティのチャットで発言できるのはコミュニティの参加者のみです。</p>
        <p>プロジェクトのチャットで発言できるのはプロジェクトに紐付けられるコミュニティの参加者のみです。</p>
    </div>
</div>
</template>

<script>
export default {
    head: {
        title: {
            inner: 'コンセプト'
        },
        meta: [{
                name: 'description',
                content: 'ここでいうコンセプトはTwitterでいうところのツイートのようなものです。ユーザーはコンセプトを登録、評価する事で間接的、非同期的に問題解決に貢献する事が出来ます。'
            },
            {
                name: 'viewport',
                content: 'width=device-width,initial-scale=1.0,user-scalable=no'
            },
            {
                charset: 'utf-8'
            }
        ]
    }
}
</script>
